Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SetPressureDropOverride(Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData,System.Double)
Sets the overridden value of pressure drop.
analyticalModel:
The analytical model data that this segment belongs to.
pressureDrop:
The new pressure drop value, in kg/(ft*s^2). Note that the negative value indicates the pressure gain at the flow direction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SetComments(Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData,System.String)
Sets the comments for this analytical segment.
analyticalModel:
The analytical model data that this segment belongs to.
newComments:
The new comments.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetPressureDropOverride
Gets the overidden value of pressuer drop, in kg/(ft*s^2).
Returns:
The overridden value, or 0.0 if the pressure drop is not overridden. Note that the value can be negative to indicate the pressure gain at the flow direction.
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SetLossCoefficientOverride(Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData,System.Double)
Sets the overridden value of loss coefficient.
analyticalModel:
The analytical model data that this segment belongs to.
lossCoefficient:
The new loss coefficient value, dimensionless.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetLossCoefficientOverride
Gets the overridden value of loss coefficient, dimensionless.
Returns:
The overridden value, or 0.0 if the loss efficient is not overridden.
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.IsSegmentOverridable
Verifies if the segment can be overridden (e.g., the pressure drop of the pump and curve segments are calculated from the network and cannot be overridden).
Returns:
True if the segment can be overridden for the loss coefficient or pressure drop, false if the segment cannot be overriden.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SetOverrideType(Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData,Autodesk.Revit.DB.Analysis.SegmentOverrideType)
Sets the override type of pressure loss calculation.
analyticalModel:
The analytical model data that this segment belongs to.
overrideType:
The new override type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The segment cannot be overridden for the pressure loss calculation.
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetFlowCharacteristics(Autodesk.Revit.DB.Document)
Gets all flow characteristics of the segment.
doc:
The document of this segment.
Returns:
All flow characteristics of the segment in one string, empty if all characteristics are undefined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetFlowTransitionCharacteristic(Autodesk.Revit.DB.Document)
Gets the flow transition characteristic of the segment.
doc:
The document of this segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetFlowConvergenceCharacteristic(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic@)
Gets the flow convergence characteristic of the segment.
doc:
The document of this segment.
outPosition:
The acquired flow position characteristic of the segment, undefined if the convergence characteristic is undefined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetSegment(Autodesk.Revit.DB.Subelement)
Gets the analytical segment from the Subelement
subElem:
The subelement of the analytical segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The subelement must be a valid analytical segment subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.GetSubelement(Autodesk.Revit.DB.Document)
Gets the subelement of this segment.
pADoc:
The document of this segment.
Returns:
The subelement of this segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Comments
The comments for this analytical segment.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.OverrideType
The override type of analytical segment pressure loss calculation.
Since:
2024